# Understanding some more methods using the cheat sheet by datacamp

In [1]:
import pandas as pd

In [2]:
s=pd.Series(['pune','kolkata','bhubaneswar','visakhapatnam'])

In [3]:
s

0             pune
1          kolkata
2      bhubaneswar
3    visakhapatnam
dtype: object

In [4]:
s.shape

(4,)

In [11]:
data2={"country": ["India", "pakistan","srilanka"],
      "population": [13, 10,6],
      "capital":['Delhi','islamabad','colombo']
     }

In [7]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [14]:
df=pd.DataFrame(data2)

In [15]:
df

    country  population    capital
0     India          13      Delhi
1  pakistan          10  islamabad
2  srilanka           6    colombo

In [17]:
 df.drop('country',axis=1)

   population    capital
0          13      Delhi
1          10  islamabad
2           6    colombo

In [19]:
df.drop(columns='capital')

    country  population
0     India          13
1  pakistan          10
2  srilanka           6

In [20]:
help(pd.Series.rank)

Help on function rank in module pandas.core.generic:

rank(self: 'NDFrameT', axis: 'Axis' = 0, method: 'str' = 'average', numeric_only: 'bool_t' = False, na_option: 'str' = 'keep', ascending: 'bool_t' = True, pct: 'bool_t' = False) -> 'NDFrameT'
    Compute numerical data ranks (1 through n) along axis.

    By default, equal values are assigned a rank that is the average of the
    ranks of those values.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Index to direct ranking.
        For `Series` this parameter is unused and defaults to 0.
    method : {'average', 'min', 'max', 'first', 'dense'}, default 'average'
        How to rank the group of records that have the same value (i.e. ties):

        * average: average rank of the group
        * min: lowest rank in the group
        * max: highest rank in the group
        * first: ranks assigned in order they appear in the array
        * dense: like 'min', but rank always increases by 1 between groups.

    numeric_only : bool, default False
        For DataFrame objects, rank only numeric columns if set to True.

        .. versionchanged:: 2.0.0
            The default value of ``numeric_only`` is now ``False``.

    na_option : {'keep', 'top', 'bottom'}, default 'keep'
        How to rank NaN values:

        * keep: assign NaN rank to NaN values
        * top: assign lowest rank to NaN values
        * bottom: assign highest rank to NaN values

    ascending : bool, default True
        Whether or not the elements should be ranked in ascending order.
    pct : bool, default False
        Whether or not to display the returned rankings in percentile
        form.

    Returns
    -------
    same type as caller
        Return a Series or DataFrame with data ranks as values.

    See Also
    --------
    core.groupby.DataFrameGroupBy.rank : Rank of values within each group.
    core.groupby.SeriesGroupBy.rank : Rank of values within each group.

    Examples
    --------
    >>> df = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog',
    ...                                    'spider', 'snake'],
    ...                         'Number_legs': [4, 2, 4, 8, np.nan]})
    >>> df
        Animal  Number_legs
    0      cat          4.0
    1  penguin          2.0
    2      dog          4.0
    3   spider          8.0
    4    snake          NaN

    Ties are assigned the mean of the ranks (by default) for the group.

    >>> s = pd.Series(range(5), index=list("abcde"))
    >>> s["d"] = s["b"]
    >>> s.rank()
    a    1.0
    b    2.5
    c    4.0
    d    2.5
    e    5.0
    dtype: float64

    The following example shows how the method behaves with the above
    parameters:

    * default_rank: this is the default behaviour obtained without using
      any parameter.
    * max_rank: setting ``method = 'max'`` the records that have the
      same values are ranked using the highest rank (e.g.: since 'cat'
      and 'dog' are both in the 2nd and 3rd position, rank 3 is assigned.)
    * NA_bottom: choosing ``na_option = 'bottom'``, if there are records
      with NaN values they are placed at the bottom of the ranking.
    * pct_rank: when setting ``pct = True``, the ranking is expressed as
      percentile rank.

    >>> df['default_rank'] = df['Number_legs'].rank()
    >>> df['max_rank'] = df['Number_legs'].rank(method='max')
    >>> df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom')
    >>> df['pct_rank'] = df['Number_legs'].rank(pct=True)
    >>> df
        Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
    0      cat          4.0           2.5       3.0        2.5     0.625
    1  penguin          2.0           1.0       1.0        1.0     0.250
    2      dog          4.0           2.5       3.0        2.5     0.625
    3   spider          8.0           4.0       4.0        4.0     1.000
    4    snake          NaN           NaN       NaN        5.0       NaN

In [21]:
df.rank()

   country  population  capital
0      1.0         3.0      1.0
1      2.0         2.0      3.0
2      3.0         1.0      2.0

In [22]:
df

    country  population    capital
0     India          13      Delhi
1  pakistan          10  islamabad
2  srilanka           6    colombo

# Dropping 2 columns at the same time

In [26]:

df2=df.drop(columns=['country','capital'])

In [27]:
df2

   population
0          13
1          10
2           6

# using lambda function for numerical values inside the table

In [28]:
f= lambda x:x*x
df2.apply(f)

   population
0         169
1         100
2          36